//
//  Error.strings
//  TheBox iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Nome de usuário ou senha errado";
"_cancelled_by_user"                    = "Transferência cancelada";
"_error_folder_destiny_is_the_same_"    = "Não foi possível mover a pasta para ela mesma";
"_error_not_permission_"                = "Você não tem permissão para completar a operação";
"_error_path_"                          = "Não foi possível abrir este arquivo ou pasta. Certifique-se que existam";
"_file_upload_not_exitst_"              = "O arquivo para enviar não existe";
"_forbidden_characters_from_server_"    = "O nome contém pelo menos um caracter inválido";
"_not_connected_internet_"              = "Erro de conexão ao servidor";
"_not_possible_connect_to_server_"      = "Não foi possível conectar ao servidor neste momento";
"_not_possible_create_folder_"          = "Não foi possível criar a pasta";
"_server_down_"                         = "O servidor está inacessível";
"_time_out_"                            = "Timeout, tente novamente";
"_unknow_response_server_"              = "Resposta inesperada do servidor";
"_user_autentication_required_"         = "Autenticação do usuário é requerida";
"_file_directory_locked_"               = "Arquivo ou diretório bloqueado";
"_ssl_certificate_untrusted_"           = "O certificado para este servidor é inválido";
"_internal_server_"                     = "Erro Interno do Servidor";

"_file_already_exists_"                 = "Não foi possível completar a operação pois existe um arquivo com o mesmo nome";
"_file_folder_not_exists_"              = "O arquivo de origem não foi encontrado no caminho especificado";
"_folder_contents_nochanged_"           = "O conteúdo da pasta não foi modificada";
"_images_invalid_converted_"            = "A imagem é inválida e não pode ser convertida para uma miniatura";
"_method_not_expected_"                 = "Método de solicitação não esperado";
"_reauthenticate_user_"                 = "Acesso expirado. Por favor reautentique o usuário";
"_server_error_retry_"                  = "O servidor está temporariamente indisponível";
"_too_many_files_"                      = "Muitos arquivos seriam envolvidos nesta operação para completar com sucesso";
"_too_many_request_"                    = "Taxa limite alcançada—muitas solicitações enviadas";
"_user_over_quota_"                     = "A cota de armazenamento foi alcançada";

"_ssl_connection_error_"                = "Conexão SSL com erro, tente novamente";
